app/views/questions/show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 1
---
<ul id='answers'>
  <% @question.answers.each do |answer| %>