app/controllers/answers_controller.rb

INSERT INTO "answers" ("created_at", "question_id", "response", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 28 Jul 2013 19:27:55 UTC +00:00], ["question_id", 1], ["response", ""], ["title", ""], ["updated_at", Sun, 28 Jul 2013 19:27:55 UTC +00:00]]
---
def create
  @answer = @question.answers.build(params[:answer])
  @answer.user = current_user
  if @answer.save

UPDATE "answers" SET "title" = 'Seriously!', "response" = '
---
  def update
    if @answer.update_attributes(params[:answer])

DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 1]]
---
  def destroy
    @answer.destroy

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def find_question
    @question = Question.find(params[:question_id])

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 1 AND "answers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def find_answer
    @answer = @question.answers.find(params[:id])