app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT "questions".* FROM "questions"

  def create
    @question = Question.new(params[:question])
    if @question.save
---
INSERT INTO "questions" ("created_at", "query", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 28 Jul 2013 18:44:56 UTC +00:00], ["query", ""], ["title", "Good Question"], ["updated_at", Sun, 28 Jul 2013 18:44:56 UTC +00:00]]

  def update
    if @question.update_attributes(params[:question])
---
UPDATE "questions" SET "title" = 'Better Question', "query" = '', "updated_at" = '2013-07-28 18:26:37.963959' WHERE "questions"."id" = 1

  def destroy
    @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]

  def find_question
    @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]